src/Catalogs/Промокоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Промокоды</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Владельцы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаПромокода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реферальный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыСотрудников</v8:Type>
						<v8:Type>cfg:CatalogRef.СегментыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/Промокоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Промокоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Промокод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Промокоды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/Промокоды/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции 
// Процедуры пометки удаления добавлены в свя с тем, что при установке и снятии пометок
// необходим вывод сообщений пользователю. Отловить установку пометки удаления для формы списка справочника невозможно.

// Процедура - Удалить промокод на сервере
//
процедура УдалитьПромокодНаСервере(Промокод) Экспорт	
	 
	НаборЗаписей = РегистрыСведений.Промокоды.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Вид.Установить(Промокод);
	Попытка
		НаборЗаписей.Записать();  
		ПромокодОбъект = Промокод.ПолучитьОбъект();
		ПромокодОбъект.ДополнительныеСвойства.Вставить("ПромокодУдален");
		ПромокодОбъект.ПометкаУдаления = Истина;		
		ПромокодОбъект.Записать();
		
	Исключение    
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При удалении промокодов произошла ошибка.");					
	КонецПопытки; 
		
КонецПроцедуры

// Процедура Записать промокод.
//
Процедура ЗаписатьПромокодНаСервере(Промокод, Пометка) Экспорт
	
	ПромокодОбъект = Промокод.ПолучитьОбъект();	
	
	Если Пометка = Истина Тогда
		ПромокодОбъект.ДополнительныеСвойства.Вставить("ПромокодВосстановлен");  
	Иначе                                                                
		ПромокодОбъект.ДополнительныеСвойства.Вставить("ПромокодУдален");		
	КонецЕсли;
	
	ПромокодОбъект.ПометкаУдаления = НЕ Пометка;		
	
	Попытка
		ПромокодОбъект.Записать();
	Исключение
	КонецПопытки;

КонецПроцедуры 

#КонецОбласти
